The original Ott et al. data is split as described in the paper. Further, it also has multiple txt files, which I merged into one csv file.

In [ ]:
import glob
import itertools
import pandas as pd

In [ ]:
output_dir_deceptive = '../data/ott_et_al_data/deceptive_data.txt'
output_dir_truthful = '../data/ott_et_al_data/truthful_data.txt'

deceptive_files = glob.glob('../data/ott_et_al_data/*/deceptive*/*/*.txt')
truthful_files = glob.glob('../data/ott_et_al_data/*/truthful*/*/*.txt')

In [ ]:
with open (output_dir_deceptive, 'w') as outfile:
    for line in itertools.chain.from_iterable(map(open, deceptive_files)):
        outfile.write(f"{line}")

with open (output_dir_truthful, 'w') as outfile:
    for line in itertools.chain.from_iterable(map(open, truthful_files)):
        outfile.write(f"{line}")

In [ ]:
deceptive_df = pd.read_csv(output_dir_deceptive, sep="\0", header=None, names=['text'])
truthful_df = pd.read_csv(output_dir_truthful, sep="\0", header=None,  names=['text'])

In [ ]:
deceptive_df['label'] = 0
truthful_df['label'] = 1

In [ ]:
truthful_df.head()

                                                text  label
0  My $200 Gucci sunglasses were stolen out of my...      1
1  This was a gorgeous hotel from the outside and...      1
2  The hotel is very impressive upon entering and...      1
3  Going to the Internet Retailer 2010 at the las...      1
4  I checked into this hotel, Rm 1760 on 11/13/20...      1

In [ ]:
result_df = pd.concat([truthful_df, deceptive_df])

In [ ]:
result_df.tail()

                                                  text  label
795  The Palmer House Hilton hotel takes luxury to ...      0
796  We really enjoyed our stay at the Palmer House...      0
797  The Palmer House Hilton was recommended to me ...      0
798  My stay at The Palmer House Hilton was wonderf...      0
799  Amazing! I was swept away when I walked into t...      0

In [ ]:
result_df.to_csv('../data/ott_et_al_data/ott_et_al_processed.csv', sep=";", index=False)